#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/lambda-authorizer/runs/run-Ni23DGeWnov2HCSH

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
data.aws_iam_role.lab_role: Refreshing...
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=cognito-authorizer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "cognito-authorizer"
      ~ last_modified                  = "2024-12-15T23:47:26.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:3/invocations" -> (known after apply)
      ~ source_code_hash               = "YZ/J7P3jNRLRgmtF1rfRkW8Ejb1Xq59dpYxQx7pm6Ik=" -> "/FkEu9rdib93XGqyNPvjNe3orGbLNNnGsLjNhmb94Oo="
        tags                           = {}
      ~ timeout                        = 3 -> 15
      ~ version                        = "3" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "REGION"       = "us-east-1" -> null
              - "USER_POOL_ID" = "us-east-1_examplePoolId" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*